package com.epam.training.anton_pashutkin.classes.main_task;

public class Car {
    //todo:
    /*
    Создать классы, спецификации которых приведены ниже.
    Определить конструкторы и методы setТип(), getТип(), toString().
    Определить дополнительно методы в классе, создающем массив объектов.
    Задать критерий выбора данных и вывести эти данные на консоль.
    В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.

    Car: id, Марка, Модель, Год выпуска, Цвет, Цена, Регистрационный номер.
    Создать массив объектов. Вывести:
    a) список автомобилей заданной марки;
    b) список автомобилей заданной модели, которые эксплуатируются больше n лет;
    c) список автомобилей заданного года выпуска, цена которых больше указанной.
    */


}
